Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: Returns a Boolean value that indicates whether the key-value coding methods should access the corresponding instance variable directly on finding no accessor method for a property.
ja: キー値コーディングメソッドが、プロパティのためのアクセッサメソッドでないものを見つける上で、対応インスタンス変数に直接にアクセスすべきどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the next map-table pair in the enumeration are set.
ja: 列挙の中の次のマップテーブルペアが設定されるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the observed object supports automatic key-value observation for the given key.
ja: 監視されるオブジェクトが自動キー値監視を与えられたキーに対してサポートするかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the operating system appears able to execute a specified file.
ja: オペレーティングシステムが指定されたファイルを実行する能力を備えるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the point is in the specified rectangle.
ja: その点が指定された矩形の中にあるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the receiver conforms to a given protocol.
ja: レシーバが指定したプロトコルに準拠するかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the receiver contains a given object.
ja: 与えられたオブジェクトをレシーバが含んでいるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the receiver is "like" another given object.
ja: レシーバが別の与えられたオブジェクトと「似ている」かどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the receiver is equal to another given object.
ja: レシーバが別の与えられたオブジェクトと等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the receiver is greater than another given object.
ja: レシーバが別の与えられたオブジェクトより大きいかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the receiver is greater than or equal to another given object.
ja: レシーバが別の与えられたオブジェクトより大きいまたは等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the receiver is less than another given object.
ja: レシーバが別の与えられたオブジェクトより小さいかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the receiver is less than or equal to another given object.
ja: レシーバが別の与えられたオブジェクトより小さいまたは等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the receiver is not equal to another given object.
ja: レシーバが別の与えられたオブジェクトと等しくないかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the receiving class is a subclass of, or identical to, a given class.
ja: 受け取り手のクラスが、指定されたあるクラスのサブクラス、またはそれと同一であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the set has no members in common with the given set.
ja: この集合が、与えられた集合と共通のメンバを１つも持たないかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the set is a subset of another set.
ja: この集合は別の集合の下位集合であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the set is a superset of the given set.
ja: この集合が、与えられた集合の上位集合であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the two rectangles are equal.
ja: ２つの矩形が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the value for the specified attribute in the receiver can be set.
ja: レシーバにおいて指定された属性に対する値が設定可能かどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether this set is a strict subset of the given set.
ja: この集合は与えられた集合の狭義の下位集合であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether this set is a strict superset of the given set.
ja: この集合は与えられた集合の狭義の上位集合であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether two given ranges are equal.
ja: ２つの与えられた範囲が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether two points are equal.
ja: ２つの地点が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether two rectangles intersect.
ja: ２つの矩形が交差するかどうかを指し示すブール値を返します。

source: Returns a C-string representation of a given path that properly encodes Unicode strings for use by the file system.
ja: 与えられたパスのC文字列表現を返します、それはファイルシステムによって使うために正しくユニコード文字列をエンコードします。

source: Returns a JSON-encoded representation of the value you supply.
ja: あなたが提供する値のJSONエンコードされた表現を返します。

source: Returns a URL that can be emailed to users to allow them to download a copy of a cloud-based flat file item.
ja: あるURLを返します、それはユーザにEメールされて、彼らにクラウド基盤のフラットファイル項目のコピーをダウンロード可能にします。

source: Returns a character set containing characters in Unicode General Category Z*, U+000A ~ U+000D, and U+0085.
ja: 「ユニコード一般カテゴリ」のZ*、U+000A ~ U+000D、そしてU+0085の中の文字を含んでいる文字集合を返します。

source: Returns a character set containing individual Unicode characters that can also be represented as composed character sequences (such as for letters with accents), by the definition of “standard decomposition” in version 3.2 of the Unicode character encoding standard.
ja: 個々のユニコード文字を含んでいる文字集合を返します、それはまた合成文字シーケンスとして表されます（例えばアクセントを持つ文字などのために）、ユニコード文字エンコーディング標準のバージョン3.2での「標準分解」の定義によります。

source: Returns a character set containing the characters in Unicode General Categories L*, M*, and N*.
ja: 「ユニコード一般カテゴリ」のL*, M*、そしてN*の中の文字を含んでいる文字集合を返します。

source: Returns a character set containing the characters in Unicode General Category Cc and Cf.
ja: 「ユニコード一般カテゴリ」のCcとCfの中の文字を含んでいる文字集合を返します。

source: Returns a character set containing the characters in Unicode General Category L* & M*.
ja: 「ユニコード一般カテゴリ」L*＆M*の中の文字を含んでいる文字集合を返します。

source: Returns a character set containing the characters in Unicode General Category Ll.
ja: 「ユニコード一般カテゴリ」Llの中の文字を含んでいる文字集合を返します。

source: Returns a character set containing the characters in Unicode General Category Lt.
ja: 「ユニコード一般カテゴリ」のLtの中の文字を含んでいる文字集合を返します。

source: Returns a character set containing the characters in Unicode General Category Lu and Lt.
ja: 「ユニコード一般カテゴリ」のLuおよびLtの中の文字を含んでいる文字集合を返します。

source: Returns a character set containing the characters in Unicode General Category M*.
ja: 「ユニコード一般カテゴリ」M*の中の文字を含んでいる文字集合を返します。

source: Returns a character set containing the characters in Unicode General Category P*.
ja: 「ユニコード一般カテゴリ」P*の中の文字を含んでいる文字集合を返します。

source: Returns a character set containing the characters in Unicode General Category S*.
ja: 「ユニコード一般カテゴリ」S*の中の文字を含んでいる文字集合を返します。

source: Returns a character set containing the characters in Unicode General Category Zs and CHARACTER TABULATION (U+0009).
ja: 「ユニコード一般カテゴリ」のZsとCHARACTER TABULATION (U+0009)の中の文字を含んでいる文字集合を返します。

source: Returns a character set containing the characters in the category of Decimal Numbers.
ja: 「Decimal Numbers」のカテゴリの中の文字を含んでいる文字集合を返します。

source: Returns a character set containing the newline characters (U+000A ~ U+000D, U+0085, U+2028, and U+2029).
ja: 改行文字（U+000A ~ U+000D、U+0085、U+2028、そしてU+2029）を含んでいる文字集合を返します。

source: Returns a character set containing values in the category of Non-Characters or that have not yet been defined in version 3.2 of the Unicode standard.
ja: 「Non-Characters」のカテゴリの中の、またはユニコード標準のバージョン3.2でまだ定義されていない値を含んでいる文字集合を返します。

source: Returns a closed range that contains both of its bounds.
ja: それの境界の両方を含む完結範囲を返します。

source: Returns a copy of the receiving array sorted as specified by a given array of sort descriptors.
ja: 与えられたソート記述子の配列によって指定された通りにソートされた受け手側の配列のコピーを返します。

source: Returns a date created from the specified components.
ja: 指定された構成要素から作成される日付を返します。

source: Returns a date representation of a given string interpreted using the receiver’s current settings.
ja: シレーバの持つ現在の設定を使って解釈される、与えられた文字列の日付表現を返します。

source: Returns a date with a specified amount of time added to it.
ja: 指定された量の時間をそれに加えたある日付を返します。

source: Returns a date with a specified amount of time subtracted from it.
ja: 指定された量の時間をそれから引いたある日付を返します。

source: Returns a decimal number raised to a given power.
ja: 指定累乗されたある10進数を返します。

source: Returns a descriptor for the receiver’s Apple event attribute identified by the specified keyword.
ja: 指定されたキーワードで識別される、レシーバの持つアップルイベント属性に対する記述子を返します。

source: Returns a descriptor for the receiver’s Apple event parameter identified by the specified keyword.
ja: 指定されたキーワードで識別されるレシーバの持つアップルイベントパラメータに対する記述子を返します。

source: Returns a descriptor obtained by coercing the receiver to the specified type.
ja: レシーバを指定された型へと強制することによって入手される記述子を返します。

source: Returns a dictionary of header fields corresponding to a provided array of cookies.
ja: 提供されたクッキーからなる配列に対応する、ヘッダフィールドからなる辞書を返します。

source: Returns a dictionary that describes the POSIX attributes of the file specified at a given.
ja: 与えられるところで指定されたファイルのPOSIX属性を記述する辞書を返します。

source: Returns a dictionary that describes the attributes of the mounted file system on which a given path resides.
ja: そこにおいて与えられたパスが存在するところのマウントされたファイルシステムの属性を記述する辞書を返します。

source: Returns a directory enumerator object that can be used to perform a deep enumeration of the directory at the specified path.
ja: 指定されたパスでのディレクトリの深い列挙を実行するために使用できるディレクトリ列挙子オブジェクトを返します。

source: Returns a file handle associated with a null device.
ja: nullデバイスに結び付けられたファイルハンドルを返します。

source: Returns a file handle initialized for reading and writing to the file, device, or named socket at the specified URL.
ja: 指定されたURLでのファイル、デバイス、または名前付きソケットの読み書きのために初期化されるファイルハンドルを返します。

source: Returns a file handle initialized for reading and writing to the file, device, or named socket at the specified path.
ja: 指定されたパスでのファイル、デバイス、または名前付きソケットの読み書きのために初期化されるファイルハンドルを返します。

source: Returns a file handle initialized for reading the file, device, or named socket at the specified URL.
ja: 指定されたURLでのファイル、デバイス、または名前付きソケットの読み込みのために初期化されるファイルハンドルを返します。

source: Returns a file handle initialized for reading the file, device, or named socket at the specified path.
ja: 指定されたパスでのファイル、デバイス、または名前付きソケットの読み込みのために初期化されるファイルハンドルを返します。

source: Returns a file handle initialized for writing to the file, device, or named socket at the specified URL.
ja: 指定されたURLでのファイル、デバイス、または名前付きソケットへの書き出しのために初期化されるファイルハンドルを返します。

source: Returns a file handle initialized for writing to the file, device, or named socket at the specified path.
ja: 指定されたパスでのファイル、デバイス、または名前付きソケットへの書き出しのために初期化されるファイルハンドルを返します。

source: Returns a file type code.
ja: ファイルタイプコードを返します。

source: Returns a formatted string based on the date information in the specified object.
ja: 指定されたオブジェクトの中の日付情報に基づいて書式設定された文字列を返します。

source: Returns a formatted string based on the specified date component information.
ja: 指定された日付構成要素情報に基づいて書式設定された文字列を返します。

source: Returns a formatted string based on the specified number of seconds.
ja: 指定された秒数に基づいて書式設定された文字列を返します。

source: Returns a formatted string based on the specified start and end dates.
ja: 指定された開始および終了日付に基づいて書式設定された文字列を返します。

source: Returns a formatted string based on the time difference between two dates.
ja: ２つの日付の間の時間差に基づいて書式設定された文字列を返します。

source: Returns a half-open range that contains its lower bound but not its upper bound.
ja: それの下側の境界は含むがそれの上側の境界はそうしない半開範囲を返します。

source: Returns a host with a specific name.
ja: 指定された名前を持つホストを返します。

source: Returns a human-readable string giving the name of a given encoding.
ja: 与えられた符号化の名前を与えている、人間が読むことができる文字列を返します。

source: Returns a list of parameterized attribute names supported by the receiver.
ja: レシーバによってサポートされるパラメータ化された属性名のリストを返します。

source: Returns a localized date format string representing the given date format components arranged appropriately for the specified locale.
ja: 指定されたロケールに対して適切に整えられた、与えられた日付書式設定構成要素を表している、ローカライズされた日付書式設定文字列を返します。

source: Returns a localized description of the specified action.
ja: 指定されたアクションのローカライズされた解説を返します。

source: Returns a localized string based on the specified date components and style option.
ja: 指定された日付構成要素とスタイルオプションに基づいてローカライズされた文字列を返します。

source: Returns a localized string corresponding to a specified HTTP status code.
ja: 指定されたHTTP状態コードと対応しているローカライズされた文字列を返します。

source: Returns a localized string, using the main bundle if one is not specified.
ja: ローカライズされた文字列を返します、指定されるものがないならばメインバンドルを使っています。

source: Returns a localized version of the string designated by the specified key and residing in the specified table.
ja: 指定されたキーによって指名された、そして指定されたテーブルに属している、文字列のローカライズされたバージョンを返します。

source: Returns a map table value for the specified key.
ja: 指定されたキーに対するマップテーブル値を返します。

source: Returns a new Date representing the date calculated by adding an amount of a specific component to a given date.
ja: ある量の特定の構成要素を与えられた日付に加えることによって計算される日付を表している新しいDateを返します。

source: Returns a new Date representing the date calculated by adding components to a given date.
ja: いくつかの構成要素を与えられた日付に加えることによって計算される日付を表している新しいDateを返します。

source: Returns a new Date representing the date calculated by setting a specific component to a given time, and trying to keep lower components the same.
ja: 特定の構成要素をある与えられた時間に設定し、そしてより低い構成要素を同じに保つよう試みることによって計算される日付を表している新しいDateを返します。

source: Returns a new Date representing the date calculated by setting hour, minute, and second to a given time on a specified Date.
ja: ある指定されたDate上のある与えられた時間に時、分、そして秒を設定することによって算出される日付を表している新しいDateを返します。

source: Returns a new NSSize from the specified values.
ja: 指定された値から、新しいNSSizeを返します。

source: Returns a new array containing the receiving array’s elements that fall within the limits specified by a given range.
ja: 受け手側の配列が持つ要素を含んでいる新しい配列を返します、それは、与えられた範囲によって指定される限度内に収まるものです。

source: Returns a new array that is a copy of the receiving array with a given object added to the end.
ja: 新しい配列を返します、それは、指定されたオブジェクトをその終わりに追加した受け手側の配列のコピーです。

source: Returns a new array that is a copy of the receiving array with the objects contained in another array added to the end.
ja: 新しい配列を返します、それは受け手側の配列のコピーで、別の配列に含まれるオブジェクトをその終わりに追加されたものです。

source: Returns a new array that lists the receiving array’s elements in ascending order as defined by the comparison function comparator.
ja: 新しい配列を返します、それは、受け手側の配列の持つ要素を昇順で比較関数comparatorによって定義されるとおりに列記するものです。

source: Returns a new collection of the same type containing, in order, the elements of the original collection that satisfy the given predicate.
ja: オリジナルのコレクションの要素で与えられた述部を満たすものを、順序正しく、含んでいる同じ型の新しいコレクションを返します。

source: Returns a new copy of the data in a specified range.
ja: 指定された範囲の中のデータの新しいコピーを返します。

source: Returns a new data buffer created by removing the given number of bytes from the front of the original buffer.
ja: 与えられたバイト数を元のバッファの先頭から取り除くことによって作成される新しいデータバッファを返します。

source: Returns a new index path containing the elements of this one plus an array of additional elements.
ja: このものの要素に追加の要素からなる配列を足して含んでいる新しいインデックスパスを返します。

source: Returns a new index path containing the elements of this one plus the given element.
ja: このものの要素に与えられた要素を足して含んでいる新しいインデックスパスを返します。

source: Returns a new index path containing the elements of this one plus those of another index path.
ja: このものの要素に別のインデックスパスのそれらを足して含んでいる新しいインデックスパスを返します。

source: Returns a new instance of the receiving class.
ja: レシーバのクラスの新しいインスタンスを返します。

source: Returns a new option set of the elements contained in this set, in the given set, or in both.
ja: このセットの中に、与えられたセットの中に、または両方の中に、含まれる要素からなる新しいオプションセットを返します。

source: Returns a new option set with only the elements contained in both this set and the given set.
ja: このセットと与えられたセットの両方の中に含まれる要素だけを持つ新しいオプションセットを返します。

source: Returns a new option set with the elements contained in this set or in the given set, but not in both.
ja: このセットの中にまたは与えられたセットの中に、しかし両方の中にではなく、含まれる要素からなる新しいオプションセットを返します。

source: Returns a new set containing the elements of this set that do not occur in the given set.
ja: 与えられた集合の中の現れないこの集合の要素を含んでいる新しい集合を返します。

source: Returns a new string containing matching regular expressions replaced with the template string.
ja: 正規表現にマッチするものをテンプレート文字列と取り替えられたもの含んでいる新しい文字列を返します。

source: Returns a new value advanced by the given distance.
ja: 与えられたインスタンスによって引き上げられる新しい値を返します。

source: Returns a partial range extending upward from a lower bound.
ja: 下側の境界から上方に拡張している部分的な範囲を返します。

source: Returns a partial range up to, and including, its upper bound.
ja: それの上側の境界までの、そしてそれを含む部分的な範囲を返します。

source: Returns a partial range up to, but not including, its upper bound.
ja: それの上側の境界までの、しかしそれを含んでいない、部分的な範囲を返します。

source: Returns a point from a text-based representation.
ja: テキストに基づく表現から、ある点を返します。

source: Returns a pointer that identifies information about all of the observers that are registered with the observed object.
ja: 監視対象オブジェクトに登録される全てのオブザーバーについての情報を識別するポインタを返します。

source: Returns a properly formatted energy string for the given value and unit.
ja: 与えられた値と単位に対して適切に書式設定されたエネルギー文字列を返します。

source: Returns a range from a textual representation.
ja: あるテキスト表現から範囲を返します。

source: Returns a rectangle from a text-based representation.
ja: テキストに基づく表現から、矩形を返します。

source: Returns a representation of the Character Set in binary format.
ja: バイナリ形式でのCharacter Setの表現を返します。

source: Returns a sequence of pairs (n, x), where n represents a consecutive integer starting at zero and x represents an element of the sequence.
ja: ベア (n, x) のシーケンスを返します、そこでnはゼロで開始する連続した数を表して、xはシーケンスの要素を表します。

source: Returns a set of key paths for properties whose values affect the value of the specified key.
ja: それらの値が指定されたキーの値に影響を与えるプロパティいくらかに対するキーパスひとそろいを返します。

source: Returns a string by adding backslash escapes as necessary to protect any characters that would match as pattern metacharacters.
ja: パターン・メタ文字とマッチするどんな文字でも保護するために必要なバックスラッシュ・エスケープを加えることによる文字列を返します。

source: Returns a string by adding backslash escapes as necessary to the given string, to escape any characters that would otherwise be treated as pattern metacharacters.
ja: そうしなければパターン・メタ文字とみなされるすべての文字をエスケープするために、与えられた文字列に必要に応じてバックスラッシュ・エスケープを加えることによって文字列を返します。

source: Returns a string containing the full name of the current user.
ja: 現在のユーザのフルネームを含んでいる文字列を返します。

source: Returns a string describing the hash table’s contents.
ja: ハッシュテーブルの内容を記述している文字列を返します。

source: Returns a string describing the map table’s contents.
ja: マップテーブルの内容を説明している文字列を返します。

source: Returns a string encoding a file type code.
ja: ファイルタイプコードをエンコードする文字列を返します。

source: Returns a string encoding a file type.
ja: ファイルタイプをエンコードする文字列を返します。

source: Returns a string of the form “{{a
ja: “{{a, b}, {c, d}}” からの文字列を返します、

source: Returns a string representation of a given date formatted using the receiver’s current settings.
ja: シレーバの持つ現在の設定を使って書式設定される、与えられた日付の文字列表現を返します。

source: Returns a string representation of a given date, formatted for the current locale using the specified date and time styles.
ja: 指定された日付と時刻スタイルを使って現在のロケールに対して書式設定される、与えられた日付の文字列表現を返します。

source: Returns a string representation of a given selector.
ja: 与えられたセレクタの文字列表現を返します。

source: Returns a string representation of a point.
ja: ある点の文字列表現を返します。

source: Returns a string representation of a range.
ja: ある範囲の文字列表現を返します。

source: Returns a string representation of a rectangle.
ja: ある矩形を表している文字列を返します。

source: Returns a string representation of a size.
ja: あるサイズの文字列表現を返します。

source: Returns a string representation of the date using the given locale.
ja: 与えられたロケールを使って時間の文字列表現を返します。

source: Returns a string representation of the decimal value appropriate for the specified locale.
ja: 指定されたロケールに適切な10進法値の文字列表現を返します。

source: Returns a string that represents the contents of the receiving class.
ja: レシーバであるクラスの内容を表した文字列を返します。

source: Returns a string with the given character folding options applied.
ja: 与えられた文字フォールディングオプションが適用された状態の文字列を返します。

source: Returns a subarray of values of an accessibility array attribute.
ja: アクセシビリティ配列属性の値からなる会配列を返します。

source: Returns a subsequence by skipping elements while predicate returns true and returning the remaining elements.
ja: predicateがtrueを返す間は要素を飛ばして残りの要素を返すことによって、ある下位シーケンスを返します。

source: Returns a subsequence containing all but the first element of the sequence.
ja: シーケンスの最初の要素以外すべてを含んでいる下位シーケンスを返します。

source: Returns a subsequence containing all but the given number of initial elements.
ja: 指定された数の冒頭要素以外すべてを含んでいる下位シーケンスを返します。

source: Returns a subsequence containing all but the last element of the sequence.
ja: シーケンスの最後の要素以外すべてを含んでいる下位シーケンスを返します。

source: Returns a subsequence containing all but the specified number of final elements.
ja: 指定された数の末尾要素以外すべてを含んでいる下位シーケンスを返します。

source: Returns a subsequence containing the initial elements until predicate returns false and skipping the remaining elements.
ja: predicateがfalseを返すまで冒頭の要素を含んでいて残りの要素を飛ばしている、ある下位シーケンスを返します。

source: Returns a subsequence from the specified position to the end of the collection.
ja: 指定された位置からコレクションの終わりまでの下位シーケンスを返します。

source: Returns a subsequence from the start of the collection through the specified position.
ja: コレクションの始まりから指定された位置までも含む下位シーケンスを返します。

source: Returns a subsequence from the start of the collection up to, but not including, the specified position.
ja: コレクションの始まりから指定された位置まで、しかしそれは含めない下位シーケンスを返します。

source: Returns a subsequence, up to the given maximum length, containing the final elements of the collection.
ja: 下位シーケンスを、指定された最大長まで、コレクションの末尾の要素を含めて返します。

source: Returns a subsequence, up to the specified maximum length, containing the initial elements of the collection.
ja: 下位シーケンスを、指定された最大長まで、コレクションの冒頭の要素を含めて返します。

source: Returns a template string by adding backslash escapes as necessary to protect any characters that would match as pattern metacharacters
ja: パターン・メタ文字とマッチするあらゆる文字を保護するために必要なバックスラッシュ・エスケープを加えることによるテンプレート文字列を返します。

source: Returns a the protocol with a given name.
ja: 与えられた名前を持つプロトコルを返します。

source: Returns a union of the Character Set with another Character Set.
ja: このCharacter Setと別のCharacter Setの和集合を返します。

source: Returns a value less than or equal to the number of elements in the sequence, nondestructively.
ja: シーケンスの要素数より少ないか等しい値を返します、非破壊的。

source: Returns a value of the type you specify, decoded from a JSON object.
ja: あなたが指定する型の値を返します、JSONオブジェクトからデコードされます。

source: Returns a version of the string with all letters converted to lowercase, taking into account the specified locale.
ja: すべての文字が小文字に変換される、この文字列の変形版を返します、指定されたロケールを考慮に入れます。

source: Returns a version of the string with all letters converted to uppercase, taking into account the specified locale.
ja: すべての文字が大文字に変換される、この文字列の変形版を返します、指定されたロケールを考慮に入れます。

source: Returns a view presenting the elements of the collection in reverse order.
ja: コレクションの要素を逆順に表しているある見方を返します。

source: Returns all of the cookie storage’s cookies, sorted according to a given set of sort descriptors.
ja: ある与えられた一揃いの短い記述によってソート（選別）される、クッキーストレージの持つクッキー全てを返します。

source: Returns all of the elements in the specified hash table.
ja: 指定されたハッシュテーブルの中の要素のすべてを返します。

source: Returns all of the keys in the specified map table.
ja: 指定されたマップテーブルの中の全てのキーを返します。

source: Returns all of the values in the specified table.
ja: 指定されたテーブルの中の全ての値が返されます。

source: Returns all the cookie storage’s cookies that are sent to a specified URL.
ja: クッキーストレージの持つクッキー全てで、ある指定されたURLに送られるものを返します。

source: Returns all the date components of a date, as if in a given time zone (instead of the Calendar time zone).
ja: ある日付の日付構成要素のすべてを返します、与えられたタイムゾーンを使います（Calendarタイムゾーンの代わりに）。

source: Returns all the date components of a date, using the calendar time zone.
ja: ある日付の日付構成要素のすべてを返します、そのカレンダーのタイムゾーンを使います。

source: Returns all the hostnames of the receiver.
ja: レシーバのホスト名の全てを返します。

source: Returns all the network addresses of the receiver.
ja: レシーバのネットワークアドレスの全てを返します。

source: Returns an NSBundle object initialized to correspond to the specified directory.
ja: 指定されたディレクトリと関連付けられるよう初期化される、NSBundleオブジェクトを返します。

source: Returns an NSBundle object initialized to correspond to the specified file URL.
ja: 指定されたファイルURLと関連付けられるよう初期化される、NSBundleオブジェクトを返します。

source: Returns an NSBundle object that corresponds to the specified directory.
ja: 指定されたディレクトリに一致するNSBundleオブジェクトを返します。

source: Returns an NSError object if the regular expression pattern is invalid; otherwise returns nil.
ja: 正規表現パターンが無効ならばNSErrorオブジェクトを返します；そうでなければnilを返します。
